Revit 2024 API
DefaultOpenFromCloudCallback Class
 A default callback that may be used to control Revit's behavior when opening a model.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
Visual Basic
Public Class DefaultOpenFromCloudCallback _
	Implements IOpenFromCloudCallback, IDisposable
Visual C++
public ref class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DefaultOpenFromCloudCallback
See Also
DefaultOpenFromCloudCallback Members
Autodesk.Revit.DB Namespace